{
  "nav-link-contact": "Contato",
  "nav-link-jobs": "Experiência",
  "nav-link-projects": "Projetos",
  "nav-link-skills": "Habilidades",
  "about-title": "Olá, mundo. Eu sou o Renan",
  "about-subtitle": "Ocupação / ",
  "about-occupation": "Desenvolvedor Front-End",
  "about-description": "Desenvolvedor Front-End especializado em React e TypeScript, com experiência em Laravel e Node.js. Participei da migração de um ERP para arquitetura moderna, desenvolvendo interfaces no Figma e integrando APIs (Google Maps, Pagar.me). Domínio em UI/UX, SEO e metodologias ágeis. Foco em performance, código limpo e soluções centradas no usuário.",
  "project-title": "Projetos",
  "project-spiderman": "Landing page do Homem-Aranha",
  "project-personal-budget": "Orçamento Pessoal",
  "project-blog": "Blog Brisa",
  "skill-title": "Habilidades",
  "experience-title": "Experiência profissional",
  "experience-1-functions-title": "Funções",
  "experience-2-functions-title": "Funções",  
  "experience-1-occupation": "Estágio em Programação",
  "experience-1-case-1": "Atuação no levantamento de requisitos para o desenvolvimento do módulo financeiro do ERP da empresa.",
  "experience-1-case-2": "Análise de processos dos setores da empresa e elaboração de diagramas UML com base nesses processos, visando à implementação de novos módulos no ERP.",
  "experience-1-case-3": "Participação no desenvolvimento do ERP da empresa, implementando dashboards e formulários com Bootstrap, além da criação de CRUDs em PHP no back-end com Laravel.",
  "experience-1-case-4": "Participação em projeto colaborativo com a Oi, implementando o layout fornecido pelo designer utilizando HTML, CSS e JavaScript, participando de reuniões com a equipe da Oi e integrando a página com a API do Pagar.me.",
  "experience-2-occupation": "Programador Front-End",
  "experience-2-case-1": "Realização de manutenções regulares no sistema ERP interno da empresa, desenvolvido em Laravel.",
  "experience-2-case-2": "Desenvolvimento e implementação de novas funcionalidades e módulos no ERP desenvolvido em Laravel.",
  "experience-2-case-3": "Liderança da transição das views do ERP construído em Laravel para uma aplicação em React, proporcionando o desacoplamento do Front-End em uma aplicação separada.",
  "experience-2-case-4": "Coordenação da migração das implementações do sistema antigo em Laravel para uma estrutura de API mais eficiente.",
  "experience-2-case-5": "Desenvolvimento de uma aplicação em React para roteirização de entregas e retiradas, integrada à API do Google Maps.",
  "experience-2-case-6": "Realização de correções de bugs e melhorias visuais em um e-commerce na plataforma Shopify.",
  "experience-2-case-7": "Criação de um jogo de bebidas (drink game) utilizando React.",
  "experience-2-case-8": "Colaboração no desenvolvimento de design de layouts utilizando o Figma.",
  "experience-2-case-9": "Realização de testes e depuração de código.",
  "experience-2-case-10": "Proposição de soluções para melhorias nos processos existentes.",
  "footer-title": "Vamos conversar",
  "footer-email": "Me envie um e-mail",
  "footer-linkedin": "Vamos nos conectar - LinkedIn",
  "footer-github": "Colabore comigo - GitHub"
}
